Repository: shurizzle/indent
Catalog: po/*.po
Languages: ka

source: usage: indent file [-o outfile ] [ options ] indent file1 file2 ... fileN [ options ]
ka: გამოყენება: indent ფაილი [-o გამოტანისფაილი ] [ პარამეტრები ] indent ფაილი1 ფაილი2 ... ფაილიN [ პარამეტრები ]

source: %s: missing argument to parameter %s
ka: %s: აკლია არგუმენტი პარამეტრისთვის %s

source: %s: unknown option "%s"
ka: %s: უცნობი პარამეტრი "%s"

source: option: %s
ka: პარამეტრი: %s

source: %s: option ``%s'' requires a numeric parameter
ka: %s: მარამეტრს ``%s'' რიცხვითი პარამეტრი სჭირდება

source: set_option: internal error: p_type %d
ka: set_option: შიდა შეცდომა: p_type %d

source: Profile contains an unterminated comment
ka: პროფილი არასწორად დასრულებულ კომენტარს შეიცავს

source: Profile contains unpalatable characters
ka: პროფილი შეიცავს სიმბოლოებს, რომლების ჩვენებაც შეუძლებელია

source: File named by environment variable %s does not exist or is not readable
ka: ფაილი, რომელზეც გარემოს ცვლადი %s მიუთითებს, არ არსებობს, ან მისი წაკითხვა შეუძლებელია

source: indent: Strange version-control value
ka: indent: version-control-ის უცნაური მნიშვნელობა

source: indent: Using numbered-existing
ka: indent: გამოიყენება numbered-existing

source: indent: Can't make backup filename of %s
ka: indent: შეუძლებელია მარქაფის ფაილის სახელის შექმნა ფაილისთვის %s

source: Can't open backup file %s
ka: ვერ გავხსენი მარქაფის ფაილი %s

source: Can't write to backup file %s
ka: ვერ ჩავწერე მარქაფის ფაილში %s

source: Can't preserve modification time on backup file %s
ka: შერ შევინარჩუნე ცვლილების თარიღი მარქაფის ფაილზე %s

source: indent: Virtual memory exhausted.
ka: indent: ვირტუალური მეხსიერება ამოწურულია.

source: indent: Fatal Error:
ka: indent: ფაილის შეცდომა:

source: indent: System Error:
ka: indent: სისტემური შეცდომა:

source: Warning
ka: გაფრთხილება

source: Error
ka: შეცდომა

source: EOF encountered in comment
ka: კომენტარში აღმოჩენილია ფაილის დასრულების სიმბოლო

source: Line broken
ka: ხაზი გაფუჭებულია

source: Unexpected end of file
ka: ფაილის მოულოდნელი ბოლო

source: There were %d non-blank output lines and %d comments
ka: აღმოჩენილია %d არაცარიელი გამოტანის ხაზი და %d კომენტარი

source: (Lines with comments)/(Lines with code): %6.3f
ka: (ხაზები კომენტარით)/(ხაზები კოდით): %6.3f

source: Line broken 2
ka: ხაზი დაზიანებულია 2

source: indent: only one output file (2nd was %s)
ka: indent: მხოლოდ, ერთი გამოტანის ფაილი (მეორე იყო %s)

source: indent: only one input file when output file is specified
ka: indent: მხოლოდ, ერთი შეყვანის ფაილი მაშინ, როცა მითითებულია გამოტანის ფაილი

source: indent: can't have filenames when specifying standard input
ka: indent: სტანდარტული შეყვანის მითითებისას ფაილის სახელებს ვერ მიუთითებთ

source: indent: only one input file when stdout is used
ka: indent: შესაძლებელია, მხოლოდ, ერთი შეყვანის ფაილი, როცა გამოიყენება stdout

source: command line
ka: ბრძანების სტრიქონი

source: Read profile %s
ka: წაკითხულია პროფილი %s

source: Can't open input file %s
ka: გახსნის შეცდომა შეყვანის ფაილისთვის %s

source: Can't stat input file %s
ka: აღმოჩენის შეცდომა შეყვანის ფაილისთვის %s

source: Zero-length file %s
ka: ფაილი %s ნულოვანი სიგრძისაა

source: File %s is too big to read
ka: ფაილის %s ძალიან დიდია წასაკითხად

source: System problem reading file %s
ka: სისტემის პრობლემა წაკითხვის მცდელობისას ფაილისთვის %s

source: Error reading input file %s
ka: წაკითხვის შეცდომა შეყვანის ფაილისთვის %s

source: Error closing input file %s
ka: დახურვის შეცდომა შეყვანის ფაილისთვის %s

source: File %s contains NULL-characters: cannot proceed
ka: ფაილი %s NULL-სიმბოლოებს შეიცავს: გაგრძელება შეუძლებელია

source: Unterminated character constant
ka: სპეციალური სიმბოლოთი დაუსრულებელი სიმბოლური მუდმივა

source: Unterminated string constant
ka: სპეციალური სიმბოლოთი დაუსრულებელი სტრიქონის მუდმივა

source: old style assignment ambiguity in "=%s". Assuming "= %s"
ka: ძველი სტილის მინიჭების გაურკვევლობა '=%s'-ში. ჩაითვლება, როგორც "=%s"

source: indent: can't create %s
ka: indent: %s ვერ შეიქმნა

source: Can't close output file %s
ka: დახურვის შეცდომა გამოტანის ფაილისთვის %s

source: Can't preserve modification time on output file %s
ka: შეუძლებელია ცვლილების დროის შენარჩუნება გამოტანის ფაილზე %s

source: Unmatched 'else'
ka: 'else'-ს არაფერი ემთხვევა

source: Stmt nesting error.
ka: გამოსახულების ერთმანეთში ჩასმის შეცდომა.

source: Unknown code to parser
ka: უცნობი კოდი დამმუშავებლისთვის

source: CANNOT FIND '@' FILE!
ka: ვერ ვიპოვე ფაილი'@' !
